---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
HomeCamera Properties
HomeCamera Class See Also Send Feedback
---

The HomeCamera type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | BottomAngleOfFieldOfView | The bottom angle of the field of view. |
|  | Center | The zoom or orbit center. |
|  | EyePosition | The eye position point. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | LeftAngleOfFieldOfView | The left angle of the field of view. |
|  | OrthogonalProjectionHeight | The height of orthogonal projection view volume. |
|  | OrthogonalProjectionWidth | The width of orthogonal projection view volume. |
|  | Pivot | The pivot point. |
|  | RightAngleOfFieldOfView | The right angle of the field of view. |
|  | TopAngleOfFieldOfView | The top angle of the field of view. |
|  | UpDirection | The up direction vector. |
|  | ViewId | The id of the view which is associated to this document's Home view orientation. |

# See Also

HomeCamera Class

Autodesk.Revit.DB Namespace